In [70]:
import pandas as pd
import numpy as np

In [3]:
path = "D:\ML2023\Customers.csv"
df = pd.read_csv(path)

In [4]:
df.head()

   CustomerID Segment Currency
0          10     LAM      EUR
1         100     LAM      EUR
2        1000     KAM      CZK
3       10000     SME      CZK
4       10001     SME      CZK

In [5]:
df_sorted = df.sort_values(by='CustomerID', ascending=False)

In [6]:
top_5_customers = df_sorted.head(5)

In [7]:
top_5_customers

       CustomerID Segment Currency
47835       53508     SME      EUR
47834       53506     SME      EUR
47833       53505     SME      CZK
47832       53504     SME      EUR
47831       53503     SME      CZK

In [51]:
path = "D:\ML2023\gasstations.csv"
df = pd.read_csv(path)

In [52]:
df.head()

   SiteID  chainID Country          Segment
0     100       10     CZE            Other
1    1000        1     CZE          Premium
2    1001        8     CZE  Value for money
3    1002       24     CZE         Discount
4    1003       13     CZE  Value for money

In [53]:
df_sorted = df.sort_values(by='SiteID', ascending=False)

In [54]:
top_5_gasstations = df_sorted.head(5)

In [55]:
top_5_gasstations

      SiteID  chainID Country  Segment
5251    5772       16     CZE    Other
5250    5771        2     CZE   Noname
5249    5770        6     CZE  Premium
5247    5769      153     SVK    Other
5246    5768        3     CZE    Other

In [13]:
path = "D:\ML2023\products.csv"
df = pd.read_csv(path)

In [14]:
df.head()

   ProductID               Description
0          1              Rucní zadání
1         10              Mazadla/Tuky
2        100  Membership-fee Consorcio
3        101                    Diesel
4        102                 Biodiesel

In [16]:
df_sorted = df.sort_values(by='ProductID', ascending=False)

In [17]:
top_5_products = df_sorted.head(5)

In [18]:
top_5_products

     ProductID                      Description
551        630  CCS Carnet Pronájem HW (Manual)
547        605      Replacement of UTA MultiBox
546        604                Zprostredk.nakupu
545        603                     Ethanol E-85
544        602                              CNG

In [71]:
path = "D:\ML2023\sample.csv"
df = pd.read_csv(path)

In [72]:
df.head()

,Date,Time,CustomerID,CardID,GasStationID,ProductID,Amount,Price
0,2012-01-01,00:18:00,41113,645177,363,2,93.75,2038.5750
1,2012-01-01,02:05:00,30766,496967,1083,2,132.10,3002.6920
2,2012-01-01,00:27:00,31576,618868,109,5,21.35,462.9240
3,2012-01-01,06:56:00,3800,598481,5298,322,52.50,47.0239
4,2012-01-01,05:46:00,3493,34405,5163,317,70.00,61.8310

In [23]:
day_23 = df[df['Date'] == '2012-01-23']
day_24 = df[df['Date'] == '2012-01-24']
day_25 = df[df['Date'] == '2012-01-25']
day_26 = df[df['Date'] == '2012-01-26']

In [24]:
desc_23 = day_23.describe()
desc_24 = day_24.describe()
desc_25 = day_25.describe()
desc_26 = day_26.describe()

In [25]:
print("Statistik untuk Hari 23:")
print(desc_23)

print("\nStatistik untuk Hari 24:")
print(desc_24)

print("\nStatistik untuk Hari 25:")
print(desc_25)

print("\nStatistik untuk Hari 26:")
print(desc_26)

Statistik untuk Hari 23:
       CustomerID  CardID  GasStationID  ProductID  Amount  Price
count         0.0     0.0           0.0        0.0     0.0    0.0
mean          NaN     NaN           NaN        NaN     NaN    NaN
std           NaN     NaN           NaN        NaN     NaN    NaN
min           NaN     NaN           NaN        NaN     NaN    NaN
25%           NaN     NaN           NaN        NaN     NaN    NaN
50%           NaN     NaN           NaN        NaN     NaN    NaN
75%           NaN     NaN           NaN        NaN     NaN    NaN
max           NaN     NaN           NaN        NaN     NaN    NaN

Statistik untuk Hari 24:
       CustomerID  CardID  GasStationID  ProductID  Amount  Price
count         0.0     0.0           0.0        0.0     0.0    0.0
mean          NaN     NaN           NaN        NaN     NaN    NaN
std           NaN     NaN           NaN        NaN     NaN    NaN
min           NaN     NaN           NaN        NaN     NaN    NaN
25%           NaN     NaN           NaN        NaN     NaN    NaN
50%           NaN     NaN           NaN        NaN     NaN    NaN
75%           NaN     NaN           NaN        NaN     NaN    NaN
max           NaN     NaN           NaN        NaN     NaN    NaN

Statistik untuk Hari 25:
       CustomerID  CardID  GasStationID  ProductID  Amount  Price
count         0.0     0.0           0.0        0.0     0.0    0.0
mean          NaN     NaN           NaN        NaN     NaN    NaN
std           NaN     NaN           NaN        NaN     NaN    NaN
min           NaN     NaN           NaN        NaN     NaN    NaN
25%           NaN     NaN           NaN        NaN     NaN    NaN
50%           NaN     NaN           NaN        NaN     NaN    NaN
75%           NaN     NaN           NaN        NaN     NaN    NaN
max           NaN     NaN           NaN        NaN     NaN    NaN

Statistik untuk Hari 26:
       CustomerID  CardID  GasStationID  ProductID  Amount  Price
count         0.0     0.0           0.0        0.0     0.0    0.0
mean          NaN     NaN           NaN        NaN     NaN    NaN
std           NaN     NaN           NaN        NaN     NaN    NaN
min           NaN     NaN           NaN        NaN     NaN    NaN
25%           NaN     NaN           NaN        NaN     NaN    NaN
50%           NaN     NaN           NaN        NaN     NaN    NaN
75%           NaN     NaN           NaN        NaN     NaN    NaN
max           NaN     NaN           NaN        NaN     NaN    NaN

In [32]:
print(df.columns)

Index(['Date', 'Time', 'CustomerID', 'CardID', 'GasStationID', 'ProductID',
       'Amount', 'Price'],
      dtype='object')

In [85]:
# Mengonversi kolom 'Time' ke tipe data datetime
df['Time'] = pd.to_datetime(df['Time'])

In [89]:
#Kelompokkan data berdasarkan hari dan jam, dan hitung jumlah transaksi di setiap kelompok
transactions_by_hour = df.groupby([df['Time'].dt.dayofweek, df['Time'].dt.hour])['CustomerID'].count()

In [87]:
#Temukan jam dan hari dengan jumlah transaksi tertinggi
best_time = transactions_by_hour.idxmax()
hour_of_day = best_time

In [88]:
print(f"Waktu terbaik adalah pada jam {hour_of_day}:00 dengan {transactions_by_hour.max()} transaksi.")

Waktu terbaik adalah pada jam (2, 10):00 dengan 23 transaksi.

In [ ]:
tujuan utama dari analisis data customer ini ialah :
1. untuk melihat 5 besar customer yang memiliki transaksi yang paling banyak
yang dimana menurut hasil analisis diatas ditemukan bahwasanya customer dengan nomor id 53508 merupakan customer dengan jumlah
transaksi paling banyak dengan total transaksi sebanyak 47835.
2. untuk melihat 5 besar gas station yang memiliki transaksi paling banyak
yang dimana menurut hasil analisis diatas ditemukan bahwasanya data gas station dengan SiteID 5772 merupakan ID dengan jumlah
transaksi paling banyak dengan total transaksi sebanyak 5251.
3. untuk melihat 5 besar product yang memiliki nilai transaksi paling banyak
yang dimana menurut hasil analisis diatas ditemukan bahwasanya data produk dengan Product id 630 merupakan product dengan jumlah
transaksi paling banyak dengan total transaksi sebanyak 551.
4. dataset transaction_1k tidak di temukan di sample data pada link github yang di share, jadi kami menggunakan sample data
yang memiliki 90 baris data.
5. waktu yang paling banyak user gas transaction melakukan transaksi ialah pada jam 2.10 dengan total sebanyak 23 transaksi.